Revit 2027 API
ParameterTypeId.ViewDetailLevel Property
 "Detail Level"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewDetailLevel { get; }
Public Shared ReadOnly Property ViewDetailLevel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewDetailLevel {
	ForgeTypeId^ get ();
}
static member ViewDetailLevel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace